
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app-insights-connection-string
  * azurerm_key_vault_secret.app-insights-instrumentation-key
* Update
  * module.tt-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.et-ai-connection-string
  * azurerm_key_vault_secret.et-ai-instrumentation-key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app-insights-connection-string will be created
  + resource "azurerm_key_vault_secret" "app-insights-connection-string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app-insights-instrumentation-key will be created
  + resource "azurerm_key_vault_secret" "app-insights-instrumentation-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat"
      + name                    = "app-insights-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et-ai-connection-string will be destroyed
  # (because azurerm_key_vault_secret.et-ai-connection-string is not in configuration)
  - resource "azurerm_key_vault_secret" "et-ai-connection-string" {
      - id                      = "https://tax-tribunals-cft-aat.vault.azure.net/secrets/app-insights-connection-string/ef1e5cd560a04584a114b0a70d941f80" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat" -> null
      - name                    = "app-insights-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat/secrets/app-insights-connection-string/versions/ef1e5cd560a04584a114b0a70d941f80" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat/secrets/app-insights-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "ef1e5cd560a04584a114b0a70d941f80" -> null
      - versionless_id          = "https://tax-tribunals-cft-aat.vault.azure.net/secrets/app-insights-connection-string" -> null
    }

  # azurerm_key_vault_secret.et-ai-instrumentation-key will be destroyed
  # (because azurerm_key_vault_secret.et-ai-instrumentation-key is not in configuration)
  - resource "azurerm_key_vault_secret" "et-ai-instrumentation-key" {
      - id                      = "https://tax-tribunals-cft-aat.vault.azure.net/secrets/app-insights-instrumentation-key/e672ca6dfe20453b903eec343a4ef95c" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat" -> null
      - name                    = "app-insights-instrumentation-key" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat/secrets/app-insights-instrumentation-key/versions/e672ca6dfe20453b903eec343a4ef95c" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat/secrets/app-insights-instrumentation-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e672ca6dfe20453b903eec343a4ef95c" -> null
      - versionless_id          = "https://tax-tribunals-cft-aat.vault.azure.net/secrets/app-insights-instrumentation-key" -> null
    }

  # module.tt-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/tax-tribunals-aat/providers/Microsoft.KeyVault/vaults/tax-tribunals-cft-aat|tax-tribunals-cft-aat"
        name                           = "tax-tribunals-cft-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Vars":{}} -->